SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-67342-B

Comment( G5 0-4-4 Tank Engine )
Comment( FLIPPED FOR RETURN ROUTE - CHANGE CABS CTRL #E ) 

Type ( Engine )
WagonShape ( BR_G5_67342.s )
Size  ( 2.64m 4.25m 10.72m )
Mass ( 54.2t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 5cm 0cm )
              )
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 149kN ) Comment(55% Weight*Cof 0.5)
MaxHandbrakeForce ( 54kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)    

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 12ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 5227 )
ORTSDavis_B ( 18.12 )
ORTSDavis_C ( 5.075 )

ORTSWagonFrontalArea (95ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 4
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.2 4.54 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Reversed Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 3.2 4.54 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Rear Red Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 3 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddd0000 )
					Position ( 0 2.76 -5.02 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
			Light	(
			comment( Rear White Lamp Reversed Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 5 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 2.76 -5.02 ) 
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		)
	
	
Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( BR_G5_67342.s )
        PassengerCabinHeadPos ( 1.455 2.95 -1 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)


Engine ( OR-67342-B
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
			0 3.80 -1.1
			0 1 0
			0.15
			)
			SafetyValvesFX
			(
			0 3.7 -0.4
			0 1 0
			0.3
			)
			StackFX
			(
			0 4.2 3.98
			0 1 0
			0.5
			)

			CylindersFX
			(
			-0.4 0.525 4.3
			0 0 1
			0.13
			)
			CylindersFX
			(
			0.4 0.525 4.3
			0 0 1
			0.13
			)

			Injectors2FX
			(
			-1 0.8 -3
			0 -1 0
			0.15
			)
			Injectors1FX
			(
			1 0.8 -2
			0 -1 0
			0.15
			)
		)
	)

Wagon ( OR-67342-B )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 30.625in )
NumWheels ( 2 )
ORTSDriveWheelWeight ( 50.2t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Saturated )
BoilerVolume ( 145ft^3 ) 
ORTSEvaporationArea ( 1093ft^2 )
MaxBoilerPressure ( 160psi )
MaxSteamHeatingPressure ( 40psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 24in ) 
CylinderDiameter ( 18in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 15.6ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 3t-uk )
MaxTenderWaterMass ( 13600lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSMaxIndicatedHorsepower ( 590.0hp )) 

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 ) Comment(From Pawson Graph)



Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

Cabview ( B1.cvf )
HeadOut (  -1.455 2.95 -1 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "67342 G5 Tank, Local, Coal 3t, Water 1360gal, Reverse Cab, TE\n"+ " 17.26Klbf" )
 	Description (
 	"On becoming the North Eastern Railway's (NER) Locomotive Superintendent, Wilson Worsdell switched the NER's passenger tank locomotive policy from his brother's 2-4-2T Class A (LNER F8) design, back to a design resembling Fletcher's 0-4-4T BTP (LNER G6), with his G5 design. Compared to the F8s, the G5s had smaller driving wheels and greater coal and water capacities. A total of 110 were built between 1894 and 1901, across seven batches.\n"+
"The later batches replaced many of the BTPs (LNER G6), which were then converted to 0-6-0Ts (LNER J77) or push-pull locomotives.\n"+
"The G5 design served its purpose well, and no substantial changes had been made by Grouping in 1923. A modified boiler design with a single-plate barrel was used by the LNER after 1930 for replacements. This design was further modified from 1937 with an increase in boiler tubes to 205. This second modification had a dome 20in further back than on the earlier boilers.\n"+
"The G5s were noted for being sturdy, working long and economical careers. They worked throughout the North-East area, and could be found on both branch line passenger trains and the heavier suburban trains. They were regularly clocked at 60mph on the Middlesbrough to Newcastle services. The G5s were only moved away from these heavier suburban services with the arrival of the larger A8s, V1s and V3s.\n"+
"During the late 1920s and early 1930s, many of the G5s were replaced with steam railcars. In turn, the displaced G5s replaced withdrawn F8s and G6s. In further attempts to economise on branch-line routes, twenty-one G5s were converted for vacuum-operated push-pull working from 1937.\n"+
"The G5s survived pretty much intact to 1949. The first withdrawal was in 1950, but most were withdrawn between 1955 and 1958 as they were replaced by diesel railcars and DMUs (diesel multiple units). The last G5 was withdrawn in 1958."
)
)
